In [ ]:
import pandas as pd

In [ ]:
def resumetable(df):
    print(f"Dataset Shape: {df.shape}")
    summary = pd.DataFrame(df.dtypes,columns=['dtypes'])
    summary = summary.reset_index()
    summary['Name'] = summary['index']
    summary = summary[['Name','dtypes']]
    summary['Missing'] = df.isna().sum().values    
    summary['Uniques'] = df.nunique().values
    summary['First Value'] = df.loc[0].values
    
    return summary

1. Параметры заявки

In [ ]:
platnie_parametri_zayavki_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_suvk_yur_platnie_parametri_zayavki.csv') # Создаем df по таблице №1
platnie_parametri_zayavki_df.shape

(78611, 9)

In [ ]:
platnie_parametri_zayavki_df.head()

           dt         id  status  ... request_type           pay_type finance_status
0  2020-05-01  175276710  Закрыт  ...      РАЗОВАЯ  Предоплата полная    Не оплачена
1  2020-05-01  175276710  Закрыт  ...      РАЗОВАЯ  Предоплата полная       Оплачена
2  2020-05-02  181535157  Закрыт  ...      РАЗОВАЯ  Предоплата полная    Не оплачена
3  2020-05-02  181535157  Закрыт  ...      РАЗОВАЯ  Предоплата полная       Оплачена
4  2020-05-02  270301857  Закрыт  ...      РАЗОВАЯ  Предоплата полная    Не оплачена

[5 rows x 9 columns]

In [ ]:
resumetable(platnie_parametri_zayavki_df)

Dataset Shape: (78611, 9)

             Name  dtypes  Missing  Uniques          First Value
0              dt  object        0      641           2020-05-01
1              id   int64        0    24339            175276710
2          status  object        0        5               Закрыт
3           dtime  object        0    41177  2020-05-01 23:46:18
4    closing_date  object        0      671  2020-06-30 00:00:00
5  request_number  object        0    41227    072-20050001-1-55
6    request_type  object        0        1              РАЗОВАЯ
7        pay_type  object        0        3    Предоплата полная
8  finance_status  object        0        5          Не оплачена

In [ ]:
# Удалим столбец request_type, так как у всех заявок один тип
platnie_parametri_zayavki_df.drop(['request_type'], axis = 1)

               dt         id  ...           pay_type finance_status
0      2020-05-01  175276710  ...  Предоплата полная    Не оплачена
1      2020-05-01  175276710  ...  Предоплата полная       Оплачена
2      2020-05-02  181535157  ...  Предоплата полная    Не оплачена
3      2020-05-02  181535157  ...  Предоплата полная       Оплачена
4      2020-05-02  270301857  ...  Предоплата полная    Не оплачена
...           ...        ...  ...                ...            ...
78606  2020-01-31  299583495  ...  Предоплата полная    Не оплачена
78607  2020-01-31  299583495  ...  Предоплата полная       Оплачена
78608  2020-01-31  299904195  ...  Предоплата полная    Не оплачена
78609  2020-01-31  299917209  ...  Предоплата полная    Не оплачена
78610  2020-01-31  299917209  ...  Предоплата полная       Оплачена

[78611 rows x 8 columns]

In [ ]:
# Посчитаем количество заявок с разными статусами
platnie_parametri_zayavki_df['status'].value_counts()

Закрыт              65790
Документы выданы     9982
На выполнении        2032
Создан                456
Выполнен              351
Name: status, dtype: int64

In [ ]:
# Посчитаем количество заявок с разными типами оплат
platnie_parametri_zayavki_df['pay_type'].value_counts()

Предоплата полная       70705
Постоплата               6307
Предоплата частичная     1599
Name: pay_type, dtype: int64

In [ ]:
# Посчитаем количество заявок с разными статусами оплат
platnie_parametri_zayavki_df['finance_status'].value_counts()

Не оплачена             41227
Оплачена                32880
Информация о платеже     2279
Ч/оплата                 1766
Переплата                 459
Name: finance_status, dtype: int64

In [ ]:
# Посчитаем время выполнения заявок

In [ ]:
# Что-то сделаем с \N

2. Платные начисления и оплаты

In [ ]:
platnie_nachisleniya_i_oplati_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_suvk_yur_platnie_nachisleniya_i_oplati.csv') # Создаем df по таблице №2
platnie_nachisleniya_i_oplati_df.shape

(59863, 10)

In [ ]:
platnie_nachisleniya_i_oplati_df.head()

           dt         id  ... pay_sum_with_nds services_sum_cost_with_nds
0  2021-05-01  298867512  ...          27000,0                    27000,0
1  2021-05-03  299576592  ...              NaN                   167775,0
2  2021-05-04  270339015  ...         100700,0                   100700,0
3  2021-05-05  181769808  ...              NaN                    16910,0
4  2021-05-05  249456270  ...              NaN                    24500,0

[5 rows x 10 columns]

In [ ]:
resumetable(platnie_nachisleniya_i_oplati_df)

Dataset Shape: (59863, 10)

                         Name  ...                                        First Value
0                          dt  ...                                         2021-05-01
1                          id  ...                                          298867512
2                      status  ...                                             Закрыт
3                       dtime  ...                                2021-05-01 11:58:49
4                closing_date  ...                                2021-06-23 00:00:00
5              request_number  ...                                  410-21050001-1-05
6                service_name  ...  Приведение (переборка) схемы включения электро...
7         unpaid_sum_with_nds  ...                                                0,0
8            pay_sum_with_nds  ...                                            27000,0
9  services_sum_cost_with_nds  ...                                            27000,0

[10 rows x 5 columns]

In [ ]:
# Заменим все NaN на 0
platnie_nachisleniya_i_oplati_df = platnie_nachisleniya_i_oplati_df.fillna(0)
platnie_nachisleniya_i_oplati_df.isna().sum()

dt                            0
id                            0
status                        0
dtime                         0
closing_date                  0
request_number                0
service_name                  0
unpaid_sum_with_nds           0
pay_sum_with_nds              0
services_sum_cost_with_nds    0
dtype: int64

In [ ]:
# Посчитаем время выполнения заявок

In [ ]:
# Что-то сделаем с \N

In [ ]:
# Посчитаем количество заявок с разными статусами 
platnie_nachisleniya_i_oplati_df['status'].value_counts()

Закрыт              44041
Документы выданы    13350
На выполнении        1509
Создан                647
Выполнен              316
Name: status, dtype: int64

3. Обращения

In [ ]:
obrascheniya_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_suvk_yur_obrascheniya.csv') # Создаем df по таблице №3
obrascheniya_df.shape

(140282, 13)

In [ ]:
obrascheniya_df.head()

           dt         id  ...  task_number request_number
0  2020-08-01  181758615  ...  459878112,0    679205022,0
1  2020-08-01  270083496  ...          NaN    679203572,0
2  2020-08-02  297847095  ...  459888612,0    679218152,0
3  2020-08-02  297850395  ...  459888412,0    679218082,0
4  2020-08-02  297850395  ...  459888532,0    679218012,0

[5 rows x 13 columns]

In [ ]:
resumetable(obrascheniya_df)

Dataset Shape: (140282, 13)

               Name  dtypes  ...  Uniques                            First Value
0                dt  object  ...      732                             2020-08-01
1                id   int64  ...    61928                              181758615
2    request_status  object  ...        6                    в процессе принятия
3      request_type  object  ...       21                            Личная явка
4     topic_level_1  object  ...        1                          Не определено
5     topic_level_2  object  ...       12                          Не определено
6     topic_level_3  object  ...       35                 Личный кабинет клиента
7     task_priority  object  ...        4                                Средний
8       task_status  object  ...        7                             В ожидании
9         task_type  object  ...        7  Ведение учетной записи клиента ЛКК ЮЛ
10  topic_attribute  object  ...       24                          Не определено
11      task_number  object  ...    87924                            459878112,0
12   request_number  object  ...   138712                            679205022,0

[13 rows x 5 columns]

In [ ]:
# Заменим все NaN на 0
obrascheniya_df = obrascheniya_df.fillna(0)
obrascheniya_df.isna().sum()

dt                 0
id                 0
request_status     0
request_type       0
topic_level_1      0
topic_level_2      0
topic_level_3      0
task_priority      0
task_status        0
task_type          0
topic_attribute    0
task_number        0
request_number     0
dtype: int64

In [ ]:
# Удалим столбец request_type, так как у всех заявок один тип
obrascheniya_df.drop(['topic_level_1'], axis = 1)
obrascheniya_df.head(3)

           dt         id  ...  task_number request_number
0  2020-08-01  181758615  ...  459878112,0    679205022,0
1  2020-08-01  270083496  ...            0    679203572,0
2  2020-08-02  297847095  ...  459888612,0    679218152,0

[3 rows x 13 columns]

In [ ]:
# Посчитаем количество заявок с разными статусами оплат
obrascheniya_df['request_status'].value_counts()

обработано с заданием    78987
обработано               40354
прервано                 11475
в процессе принятия       9456
закрыто                      8
Не определено                2
Name: request_status, dtype: int64

10. ch.xackaton_fuv2_yur_litsa_oplati_prom

In [ ]:
litsa_oplati_prom_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_fuv2_yur_litsa_oplati_prom.csv') # Создаем df по таблице №10
litsa_oplati_prom_df.shape

(2787767, 8)

In [ ]:
litsa_oplati_prom_df.head()

   month_year  ...  by_acts_of_ex_usage_with_nds
0     2021.02  ...                           0.0
1     2021.02  ...                           0.0
2     2021.02  ...                           0.0
3     2021.02  ...                           0.0
4     2021.02  ...                           0.0

[5 rows x 8 columns]

In [ ]:
resumetable(litsa_oplati_prom_df)

Dataset Shape: (2787767, 8)

                                 Name   dtypes  Missing  Uniques  First Value
0                          month_year  float64        0       25      2021.02
1                                  id    int64        0   155230  30000375.00
2                   paid_with_nds_rub  float64        0  1826153    265789.78
3  paid_to_current_usage_with_nds_rub  float64        0  1311688    171932.27
4           paid_as_debt_with_nds_rub  float64        0  1522870     93857.50
5     paid_as_prepayment_with_nds_rub  float64        0  1337801    171932.27
6       total_realiztion_with_nds_rub  float64        0  1881246    265789.78
7        by_acts_of_ex_usage_with_nds  float64        0     1024         0.00

11. ch.xackaton_fuv2_pararmetri_avansovih_raschetov

In [ ]:
pararmetri_avansovih_raschetov_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_fuv2_pararmetri_avansovih_raschetov.csv') # Создаем df по таблице №10
pararmetri_avansovih_raschetov_df.shape

(163548, 6)

In [ ]:
pararmetri_avansovih_raschetov_df.head()

         id prepayment_date_1  ... prepayment_percent_2 fake_id
0         0                10  ...                   \N       0
1      2592                 0  ...                   \N       0
2  30000030                10  ...                   \N       0
3  30000375                10  ...                   40       0
4  30000531                10  ...                   40       0

[5 rows x 6 columns]

In [ ]:
resumetable(pararmetri_avansovih_raschetov_df)

Dataset Shape: (163548, 6)

                   Name  dtypes  Missing  Uniques First Value
0                    id   int64        0   163540           0
1     prepayment_date_1  object        0       14          10
2     prepayment_date_2  object        0        9           0
3  prepayment_percent_1  object        0       24           0
4  prepayment_percent_2  object        0       20          \N
5               fake_id   int64        0        1           0

12. ch.xackaton_fuv2_parametri_dogovora_yur_nds_mkzd_odn_finsource

In [ ]:
nds_mkzd_odn_finsource_df = pd.read_csv('/content/drive/MyDrive/DS ninjas/ch.xackaton_fuv2_parametri_dogovora_yur_nds_mkzd_odn_finsource.csv') # Создаем df по таблице №10
nds_mkzd_odn_finsource_df.shape

(163548, 6)

In [ ]:
nds_mkzd_odn_finsource_df.head()

         id  nds_is_valuable  ...  mkzd_is_valuable odn_is_valuable
0         0                1  ...                 0               0
1      2592                1  ...                 0               0
2  30000030                1  ...                 0               0
3  30000375                1  ...                 0               0
4  30000531                1  ...                 0               0

[5 rows x 6 columns]

In [ ]:
resumetable(nds_mkzd_odn_finsource_df)

Dataset Shape: (163548, 6)

               Name  dtypes  Missing  Uniques      First Value
0                id   int64        0   163540                0
1   nds_is_valuable   int64        0        2                1
2      payment_date   int64        0       10               18
3    finance_source  object        0       13  (не определено)
4  mkzd_is_valuable   int64        0        2                0
5   odn_is_valuable   int64        0        2                0